<a href="https://colab.research.google.com/github/pawelpuszcz/homework-im/blob/main/homework_json_csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_json('https://data.nasa.gov/resource/gh4g-9sfh.json')

In [3]:
df.head()

       name   id  ... :@computed_region_cbhk_fwbd :@computed_region_nnqa_25f4
0    Aachen    1  ...                         NaN                         NaN
1    Aarhus    2  ...                         NaN                         NaN
2      Abee    6  ...                         NaN                         NaN
3  Acapulco   10  ...                         NaN                         NaN
4   Achiras  370  ...                         NaN                         NaN

[5 rows x 12 columns]

In [7]:
df.to_csv('meteorite_landings.csv')

In [9]:
data = pd.read_csv('meteorite_landings.csv')

In [10]:
data.head()

   Unnamed: 0  ... :@computed_region_nnqa_25f4
0           0  ...                         NaN
1           1  ...                         NaN
2           2  ...                         NaN
3           3  ...                         NaN
4           4  ...                         NaN

[5 rows x 13 columns]